app/Models/User.php

    public function create($request)
    {
        return self::create([
            'mail_address' => $request->mail_address,
            'password' => Hash::make($request->password),
            'name' => $request->name,
            'address' => $request->address,
            'phone' => $request->phone,
        ]);
---
insert into `users` (`mail_address`, `password`, `name`, `address`, `phone`) values ('binhymhg@gmail.com', '$2y$10$3GIoyOu4Tgq98HXxtJkchOLj7HM3639v7KKJW6AvA5FcWYBSzQ8fi', 'Đỗ Bình', 'Khân thiên, hà nội', '0378917911')